fashion_api/app/controllers/fashions_controller.rb

  def index
    @fashions = Fashion.all
---
SELECT "fashions".* FROM "fashions"

  def create
    @fashion = Fashion.new(fashion_params)

    if @fashion.save
---
INSERT INTO "fashions" ("image", "info", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def set_fashion
      @fashion = Fashion.find(params[:id])
---
SELECT "fashions".* FROM "fashions" WHERE "fashions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]